local function run(msg, matches)
if matches[1] == 'م4' and is_mod(msg) then
 local text = [[
【 اعدادات الوسائط 】

【  •┈•✦•۪۫•৩﴾ ❊ ﴿৩•۪۫•✦•┈•    】

【  استخدم الاوامر التالية    】
  【  قفل + الامر 】 للقفل 
 【  فتح + الامر 】 للفتح 
【  •┈•✦•۪۫•৩﴾ ❊ ﴿৩•۪۫•✦•┈•    】

【 الــكــل 】
【 المتحركه 】
【 الـدردشه 】
【 الاونـلاين 】
【 الـلـعـب 】
【 الــصـور 】
【 الـفيديو 】
【 الـصــوت 】
【 الـبصمات 】
【 الملصقات 】
【 الـجهـات 】
【 التـوجيه 】
【 الـمواقع 】
【 الـملفات 】
【 الاشعارات 】
【  •┈•✦•۪۫•৩﴾ ❊ ﴿৩•۪۫•✦•┈•    】
【Đev @dev_iraq1  】
【Đev @x7_newbot  】
【CH @dev_iraq2  】
]]

              tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'html')

end
end
return {
  patterns = {
    "^(م4)$",
  },
  run = run
}
