local function run(msg, matches)
if matches[1] == 'م3' and is_mod(msg) then
 local text = [[
【 اعـدادات المجـموعـه 】

【  •┈•✦•۪۫•৩﴾ ❊ ﴿৩•۪۫•✦•┈•    】

【  استخدم الاوامر التالية    】
  【  قفل + الامر 】 للقفل 
 【  فتح + الامر 】 للفتح 
【  •┈•✦•۪۫•৩﴾ ❊ ﴿৩•۪۫•✦•┈•    】

【 الـروابط 】
【 التـكرار 】
【 الكـلايـش 】
【 الـتعديل 】
【 الـبوتات 】
【 الموقع 】
【 الـتــاك 】
【 الــطـرد 】
【 الأضــافة 】
【 السمايلات 】
【 الـفـشار 】
【 الطائفيه 】
【 الــردود 】
【 التـرحيب 】
【 الماركداون 】
【 اليوزر 】
【  •┈•✦•۪۫•৩﴾ ❊ ﴿৩•۪۫•✦•┈•    】
【Đev @dev_iraq1  】
【Đev @x7_newbot  】
【CH @dev_iraq2  】
]]

              tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'html')

end
end
return {
  patterns = {
    "^(م3)$",
  },
  run = run
}
