local function run(msg, matches)
if matches[1] == 'م المطور' and is_mod(msg) then
 local text = [[
✔️❰  اوامر المطورين ❱❕

【  •┈•✦•۪۫•৩﴾ ❊ ﴿৩•۪۫•✦•┈•    】

| تفعيل | تعطيل | مغادرة
❕ رفع  ➥
ادمن |مدير | مسؤول | مطور

❕تنزيل ➥
عضو |ادمن | مسؤول | مطور

حظر | حظر عام | كتم
فتح الحظر | فتح العام |فتح الكتم

المطورين | المسؤولين | الاداريين | المدراء
🚀اذاعه➥❰لنشر كلمه❱ 
🚀انشاء مجموعه➥❰لانشاء مجموعه❱ 
🚀السوبر➥❰لجعل المجموعه خارقه❱
【  •┈•✦•۪۫•৩﴾ ❊ ﴿৩•۪۫•✦•┈•    】
【Đev @dev_iraq1  】
【Đev @x7_newbot  】
【CH @dev_iraq2  】
]]

              tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'html')

end
end
return {
  patterns = {
    "^(م المطور)$",
  },
  run = run
}
